espressif/arduino-esp32/libraries/Ethernet/src/ETH.cpp
bool ETHClass::ethDetachBus(void *bus_pointer) {
  if (!bus_pointer) {
    return true;
  }
  ETHClass *bus = (ETHClass *)bus_pointer;
  bus->end();
  return true;
}

void ETHClass::setTaskStackSize(size_t size) {
  _task_stack_size = size;
}

#if CONFIG_ETH_USE_ESP32_EMAC
#if CONFIG_IDF_TARGET_ESP32
#define ETH_EMAC_DEFAULT_CONFIG() ETH_ESP32_EMAC_DEFAULT_CONFIG()
#elif CONFIG_IDF_TARGET_ESP32P4
// clang-format off
#define ETH_EMAC_DEFAULT_CONFIG()                                                  \
  {                                                                                \
    .smi_gpio = {.mdc_num = 31, .mdio_num = 52},                                   \
    .interface = EMAC_DATA_INTERFACE_RMII,                                         \
    .clock_config = {                                                              \
      .rmii = {                                                                    \
        .clock_mode = EMAC_CLK_EXT_IN,                                             \
        .clock_gpio = (emac_rmii_clock_gpio_t)ETH_RMII_CLK                         \
      }                                                                            \
    },                                                                             \
    .dma_burst_len = ETH_DMA_BURST_LEN_32,                                         \
    .intr_priority = 0,                                                            \
    .emac_dataif_gpio = {                                                          \
      .rmii = {                                                                    \
        .tx_en_num = ETH_RMII_TX_EN,                                               \
        .txd0_num = ETH_RMII_TX0,                                                  \
        .txd1_num = ETH_RMII_TX1,                                                  \
        .crs_dv_num = ETH_RMII_CRS_DV,                                             \
        .rxd0_num = ETH_RMII_RX0,                                                  \
        .rxd1_num = ETH_RMII_RX1_EN                                                \
      }                                                                            \
    },                                                                             \
    .clock_config_out_in = {                                                       \
      .rmii = {                                                                    \
        .clock_mode = EMAC_CLK_EXT_IN,                                             \
        .clock_gpio = (emac_rmii_clock_gpio_t) - 1                                 \
      }                                                                            \
    },                                                                             \
    .mdc_freq_hz = 0,                                                              \
  }
#elif CONFIG_IDF_TARGET_ESP32S31
// clang-format off
#define ETH_EMAC_DEFAULT_CONFIG()                                                  \
  {                                                                                \
    .smi_gpio = {.mdc_num = 5, .mdio_num = 6},                                     \
    .interface = EMAC_DATA_INTERFACE_RGMII,                                        \
    .clock_config = {                                                              \
      .rgmii = {                                                                   \
        .clock_rx_gpio = ETH_RMII_RX_CLK,                                          \
        .clock_tx_gpio = ETH_RMII_TX_CLK,                                          \
        .clock_phy_ref_gpio = -1                                                   \
      }                                                                            \
    },                                                                             \
    .dma_burst_len = ETH_DMA_BURST_LEN_16,                                         \
    .intr_priority = 0,                                                            \
    .emac_dataif_gpio = {                                                          \
      .rgmii = {                                                                   \
        .tx_ctl_num = ETH_RMII_TX_CTL,                                             \
        .txd0_num = ETH_RMII_TX0,                                                  \
        .txd1_num = ETH_RMII_TX1,                                                  \
        .txd2_num = ETH_RMII_TX2,                                                  \
        .txd3_num = ETH_RMII_TX3,                                                  \
        .rx_ctl_num = ETH_RMII_RX_CTL,                                             \
        .rxd0_num = ETH_RMII_RX0,                                                  \
        .rxd1_num = ETH_RMII_RX1,                                                  \
        .rxd2_num = ETH_RMII_RX2,                                                  \
        .rxd3_num = ETH_RMII_RX3,                                                  \
      }                                                                            \
    },                                                                             \
    .clock_config_out_in = {                                                       \
      .rgmii = {                                                                   \
        .clock_rx_gpio = -1,                                                       \
        .clock_tx_gpio = -1,                                                       \
        .clock_phy_ref_gpio = -1                                                   \
      }                                                                            \
    },                                                                             \
    .mdc_freq_hz = 0,                                                              \
  }
#endif
// clang-format on

#if CONFIG_SOC_EMAC_SUPPORT_1000M
#define ETH_RETURN_ON_ERROR(e, m) { esp_err_t r = e; if (r != ESP_OK) { log_e(m); return r;} }
/**
 * @brief Initialize YT8531 PHY specific configuration
 *
 * @note This function demonstrates how to configure PHY specific registers needed for proper
 *       operation of the PHY without specific PHY driver by just using the esp_eth_ioctl API.
 *       This example is YT8531 specific but you can use it as a template to configure other PHYs.
 *
 * @param eth_handle Ethernet handle
 * @return ESP_OK on success, ESP_FAIL on failure
 */
static esp_err_t eth_phy_yt8531_specific_init(esp_eth_handle_t eth_handle)
{
    /* When the YT8531 PHY is reset during the Generic 802.3 PHY driver initialization, it disables auto negotiation.
     * So we need to enable it again. This is undocumented but observed behavior.
     */
    bool auto_nego_en = true;
    ETH_RETURN_ON_ERROR(esp_eth_ioctl(eth_handle, ETH_CMD_S_AUTONEGO, &auto_nego_en), "set auto negotiation failed");

