espressif/arduino-esp32/libraries/Ethernet/src/ETH.cpp
bool ETHClass::setFullDuplex(bool on) {
  if (_eth_started) {
    log_e("This method must be called before ETH.begin()");
    return false;
  }
  if (_auto_negotiation) {
    log_w("Auto Negotiation MUST be OFF for this setting to be applied");
  }
  _full_duplex = on;
  return true;
}

bool ETHClass::autoNegotiation() const {
  if (_eth_handle == NULL) {
    return false;
  }
  bool auto_nego;
  esp_eth_ioctl(_eth_handle, ETH_CMD_G_AUTONEGO, &auto_nego);
  return auto_nego;
}

bool ETHClass::_setAutoNegotiation(bool on) {
  if (_eth_handle == NULL) {
    return false;
  }
  esp_err_t err = esp_eth_ioctl(_eth_handle, ETH_CMD_S_AUTONEGO, &on);
  if (err != ESP_OK) {
    log_e("Failed to set auto negotiation: 0x%x: %s", err, esp_err_to_name(err));
  }
  return err == ESP_OK;
}

bool ETHClass::setAutoNegotiation(bool on) {
  if (_eth_started) {
    log_e("This method must be called before ETH.begin()");
    return false;
  }
  _auto_negotiation = on;
  return true;
}

uint32_t ETHClass::phyAddr() const {
  if (_eth_handle == NULL) {
    return 0;
  }
  uint32_t phy_addr;
  esp_eth_ioctl(_eth_handle, ETH_CMD_G_PHY_ADDR, &phy_addr);
  return phy_addr;
}

uint16_t ETHClass::linkSpeed() const {
  if (_eth_handle == NULL) {
    return 0;
  }
  eth_speed_t link_speed;
  esp_eth_ioctl(_eth_handle, ETH_CMD_G_SPEED, &link_speed);
  return (link_speed == ETH_SPEED_10M) ? 10 : 100;
}

bool ETHClass::_setLinkSpeed(uint16_t speed) {
  if (_eth_handle == NULL) {
    return false;
  }
  eth_speed_t link_speed = (speed == 10) ? ETH_SPEED_10M : ETH_SPEED_100M;
  esp_err_t err = esp_eth_ioctl(_eth_handle, ETH_CMD_S_SPEED, &link_speed);
  if (err != ESP_OK) {
    log_e("Failed to set link speed: 0x%x: %s", err, esp_err_to_name(err));
  }
  return err == ESP_OK;
}

bool ETHClass::setLinkSpeed(uint16_t speed) {
  if (speed != 10 && speed != 100) {
    log_e("Ethernet currently supports only 10 or 100 Mbps link speed");
    return false;
  }
  if (_eth_started) {
    log_e("This method must be called before ETH.begin()");
    return false;
  }
  if (_auto_negotiation) {
    log_w("Auto Negotiation MUST be OFF for this setting to be applied");
  }
  _link_speed = speed;
  return true;
}

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 5, 0)
bool ETHClass::addMacFilter(uint8_t *mac_addr) {
  if (_eth_handle == NULL) {
    return false;
  }
  esp_err_t err = esp_eth_ioctl(_eth_handle, ETH_CMD_ADD_MAC_FILTER, (void *)mac_addr);
  if (err != ESP_OK) {
    log_e("Failed to add MAC filter: 0x%x: %s", err, esp_err_to_name(err));
    return false;
  }
  return true;
}

bool ETHClass::removeMacFilter(uint8_t *mac_addr) {
  if (_eth_handle == NULL) {
    return false;
  }
  esp_err_t err = esp_eth_ioctl(_eth_handle, ETH_CMD_DEL_MAC_FILTER, (void *)mac_addr);
  if (err != ESP_OK) {
    log_e("Failed to delete MAC filter: 0x%x: %s", err, esp_err_to_name(err));
    return false;
  }
  return true;
}

bool ETHClass::addMulticastFilter(IPAddress address) {
  if (address[0] < 224 || address[0] > 239) {
    log_e("Invalid multicast address");
    return false;
  }
  uint8_t mac_addr[6] = {0x01, 0x00, 0x5E, 0x00, 0x00, 0x00};
  mac_addr[3] = address[1] & 0x7F;
  mac_addr[4] = address[2];
  mac_addr[5] = address[3];
  return addMacFilter(mac_addr);
}

bool ETHClass::removeMulticastFilter(IPAddress address) {
  if (address[0] < 224 || address[0] > 239) {
    log_e("Invalid multicast address");
    return false;
  }
  uint8_t mac_addr[6] = {0x01, 0x00, 0x5E, 0x00, 0x00, 0x00};
  mac_addr[3] = address[1] & 0x7F;
  mac_addr[4] = address[2];
  mac_addr[5] = address[3];
  return removeMacFilter(mac_addr);
}

bool ETHClass::receiveAllMulticast(bool on) {
  if (_eth_handle == NULL) {
    return false;
  }
  esp_err_t err = esp_eth_ioctl(_eth_handle, ETH_CMD_S_ALL_MULTICAST, &on);
  if (err != ESP_OK) {
    log_e("Failed to set receive all multicast: 0x%x: %s", err, esp_err_to_name(err));
    return false;
  }
  return true;
}
#endif

// void ETHClass::getMac(uint8_t* mac)
// {
//     if(_eth_handle != NULL && mac != NULL){
//         esp_eth_ioctl(_eth_handle, ETH_CMD_G_MAC_ADDR, mac);
//     }
// }

size_t ETHClass::printDriverInfo(Print &out) const {
  size_t bytes = 0;
  bytes += out.print(",");
  bytes += out.print(linkSpeed());
  bytes += out.print("M");
  if (fullDuplex()) {
    bytes += out.print(",FULL_DUPLEX");
  }
  if (autoNegotiation()) {
    bytes += out.print(",AUTO");
  }
  bytes += out.printf(",ADDR:0x%" PRIX32, phyAddr());
  return bytes;
}

#if !defined(NO_GLOBAL_INSTANCES) && !defined(NO_GLOBAL_ETH)
ETHClass ETH;
#endif

#endif /* CONFIG_ETH_ENABLED */
